-- Pouring 家計簿
INSERT INTO 家計簿 VALUES ('2013-02-03', '食費', 'コーヒーを購入', 0, 380);
INSERT INTO 家計簿 VALUES ('2013-02-10', '給料', '1月の給料', 280000, 0);
INSERT INTO 家計簿 VALUES ('2013-02-11', '教養娯楽費', '書籍を購入', 0, 2800);
INSERT INTO 家計簿 VALUES ('2013-02-14', '交際費', '同期会の会費', 0, 5000);
INSERT INTO 家計簿 VALUES ('2013-02-18', '水道光熱費', '1月の電気代', 0, 7560);

-- Pouring 家計簿アーカイブ
INSERT INTO 家計簿アーカイブ VALUES ('2012-12-10', '給料', '11月の給料', 280000, 0);
INSERT INTO 家計簿アーカイブ VALUES ('2012-12-18', '水道光熱費', '水道代', 0, 4200);
INSERT INTO 家計簿アーカイブ VALUES ('2012-12-24', '食費', 'レストランみやび', 0, 5000);
INSERT INTO 家計簿アーカイブ VALUES ('2012-12-25', '居住費', '1月の家賃支払い', 0, 80000);
INSERT INTO 家計簿アーカイブ VALUES ('2013-01-10', '給料', '12月の給料', 280000, 0);
INSERT INTO 家計簿アーカイブ VALUES ('2013-01-13', '教養娯楽費', 'スッキリシネマズ', 0, 1800);
INSERT INTO 家計簿アーカイブ VALUES ('2013-01-13', '食費', '新年会', 0, 5000);
INSERT INTO 家計簿アーカイブ VALUES ('2013-01-25', '居住費', '2月の家賃支払い', 0, 80000);


-- Pouring 家計簿
INSERT INTO 家計簿集計 VALUES ('居住費', 160000, 80000, 80000, 80000, 3);
INSERT INTO 家計簿集計 VALUES ('水道光熱費', 11760, 5880, 7560, 4200, 2);
INSERT INTO 家計簿集計 VALUES ('食費', 10380, 3460, 5000, 380, 3);
INSERT INTO 家計簿集計 VALUES ('教養娯楽費', 4600, 2300, 2800, 1800, 2);
INSERT INTO 家計簿集計 VALUES ('給料', 840000, 280000, 280000, 280000, 3);


